soap-demo/src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:us="http://miet.com/soap-demo">
  <soapenv:Header/>
  <soapenv:Body>
    <us:getUserRequest>
      <us:name>Sam</us:name>
    </us:getUserRequest>
  </soapenv:Body>
</soapenv:Envelope>